<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8" />
  <title>Arolla ~ Cabinet de conseil en technologies de l'information</title>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
  <meta name="robots" content="index, nofollow" />
  <link href="style.css" rel="stylesheet" type="text/css" />
  <script src="scripts/modernizr-2.7.1.js" type="text/javascript"></script>
  <script src="scripts/jquery-1.11.0.min.js" type="text/javascript"></script>
  <script src="scripts/jquery.easing.min.js" type="text/javascript"></script>
  <!--[if lt IE 9]>
  <script src="scripts/html5shiv.js" type="text/javascript"></script>
  <![endif]-->
</head>
<body>
  <header role="banner"><a id="lnkbanner" href="./">Arolla</a></header>
  <nav>
    <a class="art" href="#whoRWe" onclick="javascript:return false;">Qui sommes-nous ?<a/>
    <a class="art" href="#srvOfr" onclick="javascript:return false;">Offre de service<a/>
    <a class="art" href="#csltOfr" onclick="javascript:return false;">Offre de conseil<a/>
    <a class="art" href="#">&Eacute;v&egrave;nements<a/>
  </nav>
  <section id="arts">
    <article id="whoRWe">
      <div class="cnt">
        <h2>Qui sommes-nous ?</h2>
        <p><span class="hglgt">Arolla</span> est une soci&eacute;t&eacute; de conseil sp&eacute;cialis&eacute;e
           dans les techniques les plus avanc&eacute;es de d&eacute;veloppement logiciel :
           <span class="hglgt">Clean Code</span>, <span class="hglgt"><abbr title="Test Driven Development">TDD</abbr></span>,
           <span class="hglgt"><abbr title="Behavior Driven Development">BDD</abbr></span>,
           <span class="hglgt">Legacy Remediation</span>, <span class="hglgt"><abbr title="Domain Driven Development">DDD</abbr></span>,
           <span class="hglgt">style de Programmation Fonctionnelle</span> et <span class="hglgt">Continuous Delivery</span>.</p>
        <p>Autour des &eacute;cosyst&egrave;mes Java et .Net, avec des incursions en Scala ou F#, notre expertise en qualit&eacute;
           de code n'est plus &agrave; d&eacute;montrer et se traduit pour nos clients par du code plus &eacute;conomique &agrave;
           maintenir et &agrave; &eacute;voluer dans la dur&eacute;e.</p>
        <p>Pour nous, le succ&egrave;s ne se con&ccedil;oit que dans la dur&eacute;e. Nous r&eacute;alisons des prestations de conseil
           et de r&eacute;alisation autour des technologies pr&eacute;sentes et &agrave; venir, dans une d&eacute;marche respectueuse
           de nos clients et de nos salari&eacute;s, ainsi que de l'environnement.</p>
        <p class="pictured"><img id="arollaDsk" src="images/arolla_desk.jpg" alt="Arolla - Bureaux" /><span class="legend">Les bureaux d'Arolla</span></p>
        <p><span class="hglgt">Arolla</span> s'adresse &agrave; diff&eacute;rents secteurs d'activit&eacute; :
           e-commerce, banque & finance, &eacute;diteurs de logiciels, m&eacute;dias notamment.
           Nous intervenons quotidiennement chez nos clients sur des probl&eacute;matiques de qualit&eacute; de code
           et de d&eacute;veloppement applicatif agile (Scrum et XP), sur des audits et formations,
           ainsi que sur la mise en &oelig;uvre concr&egrave;te des pratiques.</p>
        <p><span class="hglgt">Arolla</span> est Microsoft Silver Partner pour la comp&eacute;tence D&eacute;veloppement d'Application.</p>
        <p class="pictured"><img id="mspartner" src="images/mspartner_silver.jpg" alt="Arolla - Microsoft Silver Partner - D&eacute;veloppement d'Application" /></p>
        <p>Aujourd'hui, <span class="hglgt">Arolla</span> compte <span class="hglgt">40</span> consultants en missions pour un
           Chiffre d'Affaires proche de <span class="hglgt">3,5M&euro;</span>.</p>
        <p><span class="hglgt">Arolla</span> a obtenu l'<span class="hglgt">agr&eacute;ment Cr&eacute;dit Imp&ocirc;t Recherche</span>
           (<span class="hglgt">plus d'informations ici</span>) pour les ann&eacute;es 2011, 2012 et 2013,
           ce qui d&eacute;montre nos comp&eacute;tences en mati&egrave;re de recherche et d'innovation.</p>
        <p>Mais <span class="hglgt">Arolla</span>, ce sont avant tout <span class="hglgt">des collaborateurs</span>
           qui, gr&acirc;ce &agrave; leur &eacute;nergie et leurs talents, apportent des solutions concr&egrave;tes
           et innovantes aux probl&eacute;matiques des plus grandes entreprises de la place.</p>
      </div>
    </article>
    <article id="srvOfr">
      <div class="cnt">
        <h2>Offre de service</h2>
      </div>
    </article>
    <article id="csltOfr">
      <div class="cnt">
        <h2>Offre de conseil</h2>
        <h3></h3>
        <div>
          <p>Depuis sa cr&eacute;ation, <span class="hglgt">Arolla</span> se positionne en 
             <span class="hglgt">expert des technologies et approches de d&eacute;veloppement</span>,
             du terminal mobile &agrave; l’entreprise dans son int&eacute;gralit&eacute;.
             Cette approche s’articule autour de la programmation orient&eacute;e objet et de ses principes,
             toujours d’actualit&eacute; mais qui s’enrichissent d&eacute;sormais des principes de la 
             <span class="hglgt">programmation fonctionelle</span>.</p>
          <p>Certaines comp&eacute;tences survivent &agrave; toutes les modes, et c’est le cas des fondamentaux de l’orient&eacute; objet.
             Au-del&agrave; des modes passag&egrave;res sur les frameworks techniques et les strat&eacute;gies d’architecture,
             les principes de faible couplage et de forte coh&eacute;sion, d’immutabilit&eacute; et d’absence d’effets de bords,
             ainsi que les nombreux patterns de la litt&eacute;rature forment un solide socle de comp&eacute;tences
             pr&ecirc;t &agrave; accueillir les nombreuses et fr&eacute;quentes innovations de fa&ccedil;on pragmatique.</p>
          <p>Les plateformes telles que la JVM et .Net, d&eacute;sormais des standards dans les entreprises,
             supportent d&eacute;j&agrave; toutes ces approches, avec des langages tels que Java, C#, Groovy et Ruby,
             et sont au coeur d’&eacute;cosyst&egrave;mes dynamiques, avec des normes et frameworks
             qui prennent en charge des aspects complets d’un syst&egrave;me logiciel.
             La norme JPA et les frameworks ORM (Hibernate et NHibernate) pour la persistance,
             l’injection des d&eacute;pendances avec Spring ou Guice en sont quelques exemples.</p>
          <p><span class="hglgt">Arolla</span> est Microsoft Silver Partner pour la comp&eacute;tence D&eacute;veloppement d’Application.</p>
        </div>
      </div>
    </article>
  </section>
  <footer></footer>
  <script type="text/javascript">
(function() {
  $(document).ready(function(){
    $('a.art').click(function(event) {
      var curid = $(this).attr('href');
      $('html, body').animate(
        { scrollTop: $(curid).offset().top }
      , 500
      , 'easeInQuint');
    });
    var valeur = Math.floor((Math.random() * 4) + 1);
    $('body').css('background-image', 'url(\'images/Arolla_S' + valeur + '.jpg\')')
  });
}) ();
  </script>
</body>
</html>
