<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8" />
  <title>Arolla ~ Cabinet de conseil en technologies de l'information</title>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
  <meta name="viewport" content="width=device-width,initial-scale=1" />
  <meta name="robots" content="index, nofollow" />
  <link href="styles.css" rel="stylesheet" type="text/css" />
  
  <script src="scripts/modernizr-2.7.1.js" type="text/javascript"></script>
  <script src="scripts/jquery-1.11.0.min.js" type="text/javascript"></script>
  <script src="scripts/jquery.easing.min.js" type="text/javascript"></script>
  <!--[if lt IE 9]>
  <script src="scripts/html5shiv.js" type="text/javascript"></script>
  <![endif]-->
  <link rel="shortcut icon" type="image/x-icon" href="./favicon.ico" />
</head>
<body>
  <header role="banner"><a id="lnkbanner" href="./">Arolla</a></header>
  <nav>
    <a class="art" href="#whoRWe">Qui sommes-nous ?</a>
    <a class="art" href="#srvOfr">Offre de service</a>
    <a class="art" href="#csltOfr">Offre de conseil</a>
    <a class="art" href="#">&Eacute;v&egrave;nements</a>
  </nav>
  <section id="arts">
    <article id="whoRWe">
      <h2>Qui sommes-nous ?</h2>
      <div class="artcnt">
        <p><span class="hglgt">Arolla</span> est une soci&eacute;t&eacute; de conseil sp&eacute;cialis&eacute;e
           dans les techniques les plus avanc&eacute;es de d&eacute;veloppement logiciel :
           <span class="hglgt">Clean Code</span>, <span class="hglgt"><abbr title="Test Driven Development">TDD</abbr></span>,
           <span class="hglgt"><abbr title="Behavior Driven Development">BDD</abbr></span>,
           <span class="hglgt">Legacy Remediation</span>, <span class="hglgt"><abbr title="Domain Driven Design">DDD</abbr></span>,
           <span class="hglgt">style de Programmation Fonctionnelle</span> et <span class="hglgt">Continuous Delivery</span>.</p>
        <p>Autour des &eacute;cosyst&egrave;mes Java et .Net, avec des incursions en Scala ou F#, notre expertise en qualit&eacute;
           de code n'est plus &agrave; d&eacute;montrer et se traduit pour nos clients par du code plus &eacute;conomique &agrave;
           maintenir et &agrave; &eacute;voluer dans la dur&eacute;e.</p>
        <p>Pour nous, le succ&egrave;s ne se con&ccedil;oit que dans la dur&eacute;e. Nous r&eacute;alisons des prestations de conseil
           et de r&eacute;alisation autour des technologies pr&eacute;sentes et &agrave; venir, dans une d&eacute;marche respectueuse
           de nos clients et de nos salari&eacute;s, ainsi que de l'environnement.</p>
        <p class="pictured"><img id="arollaDsk" src="images/arolla_desk.jpg" alt="Arolla - Bureaux" /><span class="legend">Les bureaux d'Arolla</span></p>
        <p><span class="hglgt">Arolla</span> s'adresse &agrave; diff&eacute;rents secteurs d'activit&eacute; :
           e-commerce, banque & finance, &eacute;diteurs de logiciels, m&eacute;dias notamment.
           Nous intervenons quotidiennement chez nos clients sur des probl&eacute;matiques de qualit&eacute; de code
           et de d&eacute;veloppement applicatif agile (Scrum et XP), sur des audits et formations,
           ainsi que sur la mise en &oelig;uvre concr&egrave;te des pratiques.</p>
        <p><span class="hglgt">Arolla</span> est Microsoft Silver Partner pour la comp&eacute;tence D&eacute;veloppement d'Application.</p>
        <p class="pictured"><img id="mspartner" src="images/mspartner_silver.jpg" alt="Arolla - Microsoft Silver Partner - D&eacute;veloppement d'Application" /></p>
        <p>Aujourd'hui, <span class="hglgt">Arolla</span> compte <span class="hglgt">40</span> consultants en missions pour un
           Chiffre d'Affaires proche de <span class="hglgt">3,5M&euro;</span>.</p>
        <p><span class="hglgt">Arolla</span> a obtenu l'<span class="hglgt">agr&eacute;ment Cr&eacute;dit Imp&ocirc;t Recherche</span>
           (<span class="hglgt">plus d'informations ici</span>) pour les ann&eacute;es 2011, 2012 et 2013,
           ce qui d&eacute;montre nos comp&eacute;tences en mati&egrave;re de recherche et d'innovation.</p>
        <p>Mais <span class="hglgt">Arolla</span>, ce sont avant tout <span class="hglgt">des collaborateurs</span>
           qui, gr&acirc;ce &agrave; leur &eacute;nergie et leurs talents, apportent des solutions concr&egrave;tes
           et innovantes aux probl&eacute;matiques des plus grandes entreprises de la place.</p>
      </div>
    </article>
    <article id="srvOfr">
      <h2>Offre de service</h2>
      <div class="artcnt">
        <section>
          <article>
            <h3>Nos expertises</h3>
            <h4>Technologies Objet</h4>
            <div class="artcnt">
              <p>Depuis sa cr&eacute;ation, <span class="hglgt">Arolla</span> se positionne en <span class="hglgt">expert des technologies et approches de d&eacute;veloppement</span>,
                 du terminal mobile &agrave; l'entreprise dans son int&eacute;gralit&eacute;.
                 Cette approche s'articule autour de la programmation orient&eacute;e objet et de ses principes,
                 toujours d'actualit&eacute; mais qui s'enrichissent d&eacute;sormais des principes de la <span class="hglgt">programmation fonctionelle</span>.</p>
              <p>Certaines comp&eacute;tences survivent &agrave; toutes les modes, et c'est le cas des fondamentaux de l'orient&eacute; objet.
                 Au-del&agrave; des modes passag&egrave;res sur les frameworks techniques et les strat&eacute;gies d'architecture,
                 les principes de faible couplage et de forte coh&eacute;sion, d'immutabilit&eacute; et d'absence d'effets de bords,
                 ainsi que les nombreux patterns de la litt&eacute;rature forment un solide socle de comp&eacute;tences
                 pr&ecirc;t &agrave; accueillir les nombreuses et fr&eacute;quentes innovations de fa&ccedil;on pragmatique.</p>
              <p>Les plateformes telles que la JVM et .Net, d&eacute;sormais des standards dans les entreprises,
                 supportent d&eacute;j&agrave; toutes ces approches, avec des langages tels que Java, C#, Groovy et Ruby,
                 et sont au coeur d'&eacute;cosyst&egrave;mes dynamiques, avec des normes et frameworks
                 qui prennent en charge des aspects complets d'un syst&egrave;me logiciel.
                 La norme JPA et les frameworks ORM (Hibernate et NHibernate) pour la persistance,
                 l'injection des d&eacute;pendances avec Spring ou Guice en sont quelques exemples.</p>
              <p><span class="hglgt">Arolla</span> est Microsoft Silver Partner pour la comp&eacute;tence D&eacute;veloppement d'Application.</p>
              <p class="pictured"><img id="mspartner" src="images/mspartner_silver.jpg" alt="Arolla - Microsoft Silver Partner - D&eacute;veloppement d'Application" /></p>
            </div>
          </article>
          <article>
            <h4>Programmation Fonctionnelle</h4>
            <div class="artcnt">
              <p>Certaines comp&eacute;tences survivent &agrave; toutes les modes, et c'est bien le cas des principes de la <span class="hglgt">programmation fonctionnelle</span>,
                 qui en d&eacute;pit de leur &acirc;ge acc&egrave;dent enfin &agrave; la popularit&eacute;.</p>
              <p>Les principes d'immutabilit&eacute; et d'absence d'effets de bords, les op&eacute;rateurs de plus haut niveau tels que Map et Fold,
                 ainsi que les patterns fonctionnels connus ou en cours de formalisation enrichissent la fa&ccedil;on de d&eacute;velopper et de concevoir,
                 que ce soit avec un langage fonctionnel ou non. Avec l'essor de la programmation fonctionnelle arrive aussi une nouvelle conception
                 de la concurrence avec le mod&egrave;le orient&eacute; Acteurs, et des solutions pour la mont&eacute;e en charge sur de nombreux cœurs de CPU.</p>
              <p>Les plateformes telles que la JVM et .Net, des standards en entreprises, supportent imm&eacute;diatement ce mode de programmation
                 avec des langages fonctionnels tels que Scala, F#, et Clojure en particulier. Pour ceux qui ne peuvent utiliser ces langages,
                 de simples API proposent n&eacute;anmoins d'introduire certains avantages de la programmation fonctionnelle dans tout projet.</p>
            </div>
          </article>
          <article>
            <h4>Pratiques agiles</h4>
            <div class="artcnt">
              <p>Le succ&egrave;s des projets de nos clients repose aussi sur des <span class="hglgt">pratiques</span>, (&laquo; m&eacute;thodologies &raquo;).
                 Nous mettons l'accent sur les <span class="hglgt">approches dites agiles</span> de gestion de projet et parfois d'ing&eacute;nierie telles que Scrum,
                 XP et Kanban, qui toutes revendiquent l'importance des facteurs humains, m&ecirc;me dans les projets logiciels.</p>
              <p><span class="hglgt">Arolla</span> accorde en cons&eacute;quence un grand soin au recrutement et &agrave; la formation
                 de ses collaborateurs sur le d&eacute;veloppement it&eacute;ratif, l'int&eacute;gration continue,
                 les tests unitaires et l'influence sur la qualit&eacute; du code et du design de commencer par les tests
                 (<abbr title="Test Driven Development">TDD</abbr>), les tests d'acceptation automatis&eacute;s et leur r&ocirc;le en sp&eacute;cification
                 (Specifications by Example) et en auto-documentation (<abbr title="Behaviour Driven Development">BDD</abbr>).
                 M&ecirc;me l'architecture entre d&eacute;sormais dans le champ de <abbr title="Test Driven Development">TDD</abbr>,
                 pour prouver ses b&eacute;n&eacute;fices par des tests &agrave; l'&eacute;chelle du syst&egrave;me.</p>
              <p class="pictured"><img id="prtqagiles" src="images/pratiques_agile1.png" alt="Arolla - Pratiques agiles" /></p>
              <p>Cela se traduit concr&egrave;tement, selon les d&eacute;sirs de nos collaborateurs, par des formations th&eacute;oriques et pratiques,
                 des actions de veille et &eacute;videmment des participations aux conf&eacute;rences pour s'informer des avanc&eacute;es les plus r&eacute;centes
                 et profiter de retours d'exp&eacute;riences internationaux.</p>
            </div>
          </article>
          <article>
            <h4>Architecture</h4>
            <div class="artcnt">
              <p>A l'&eacute;chelle de l'entreprise et de ses probl&eacute;matiques d'int&eacute;gration,
                 <span class="hglgt">les approches orient&eacute;es ressources (ROA)</span>, par leur simplicit&eacute;
                 et l'efficacit&eacute; du syst&egrave;me de contraintes REST, concurrencent progressivement l'approche classique SOA et ses Web Services.</p>
              <p>De son cot&eacute; l'approche <span class="hglgt">Domain-Driven Design (DDD)</span> apporte des recommandations strat&eacute;giques
                 et invite &agrave; se concentrer sur le cœur de m&eacute;tier, pr&eacute;cis&eacute;ment où r&eacute;side la valeur.
                 Cette approche met l'accent sur un travail d'approfondissement progressif d'un mod&egrave;le du domaine
                 gr&acirc;ce &agrave; une communication la plus directe possible entre les experts du domaine et les experts techniques.
                 Ce travail de mod&eacute;lisation peut s'appuyer si besoin sur l'<abbr title="Unified Modeling Language">UML</abbr>.</p>
              <p>Les patterns d'int&eacute;gration d'entreprise (EI patterns), entre autres, et les concepts de bus d'entreprise (ESB)
                 deviennent aussi de plus en plus incontournables lors de la mise en œuvre d'une architecture d'entreprise,
                 qui privil&eacute;gie fr&eacute;quemment l'usage de messaging comme moyen d'int&eacute;gration.</p>
            </div>
          </article>
        </section>
        <!--
        <h3></h3>
        <div class="artcnt">
        </div>
        -->
      </div>
      <div class="artcnt">
        <h3>Consulting</h3>
        <div class="artcnt">
          <p>Vous recherchez un d&eacute;veloppeur avec des comp&eacute;tences pointues sur des techniques ou technologies,
             ou avec une exp&eacute;rience particuli&egrave;re qui enrichisse votre &eacute;quipe ?
             Vous recherchez des d&eacute;veloppeurs exp&eacute;riment&eacute;s et autonomes pour former une nouvelle &eacute;quipe le temps d'un projet ?</p>
          <h3 class="subTtl">Offrez-vous un consultant Arolla</h3>
          <p>Les consultants <span class="hglgt">Arolla</span> sont exp&eacute;riment&eacute;s
             et partagent une passion pour le <span class="hglgt">d&eacute;veloppement logiciel</span>.
             Ils aiment mettre leurs comp&eacute;tences au service des clients et de leurs projets au travers de leurs interventions.</p>
          <p>Le plus souvent en r&eacute;gie, ces interventions permettent &agrave; un client
             d'enrichir ses &eacute;quipes avec un consultant <span class="hglgt">Arolla</span> qui apporte son savoir-faire, en particulier :
             <ul>
               <li>En <span class="hglgtbld">conception et d&eacute;veloppement</span> (le plus souvent dans des contextes agiles)
                  en <a class="artlnk" href="#srvOfr">technologies objet Java & .Net</a>, avec leurs &eacute;cosyst&egrave;mes d'entreprise :
                  <span class="hglgt">web & UI, <span class="hglgt">persistance</span>, <span class="hglgt">int&eacute;gration</span>
                  et tous les <span class="hglgt">frameworks associ&eacute;s</span></li>
               <li>En <span class="hglgt">accompagnement</span> dans la mise en place des <span class="hglgt">pratiques agiles</span>
                   (optimisation de l'<span class="hglgt">usine logicielle</span>, am&eacute;lioration continue,
                   <span class="hglgt">Scrum</span>, <span class="hglgt">XP</span>)</li>
               <li>En techniques de <span class="hglgt">qualit&eacute; de code</span>, en particulier
                   <span class="hglgt"><abbr title="Test Driven Development">TDD</abbr></span>, en pair-programming partiel ou non</li>
               <li>En techniques de <span class="hglgt">tests fonctionnels automatis&eacute;s</span> selon l'approches
                   <span class="hglgt"><abbr title="Behavior Driven Development">BDD</abbr></span></li>
             </ul></p>
          <p>Les consultants <span class="hglgt">Arolla</span> sont attentifs &agrave; l'&eacute;volution de l'<span class="hglgt">&eacute;tat de l'art</span>,
             tout en restant <span class="hglgt">pragmatiques</span> car la priorit&eacute; reste toujours de livrer la valeur attendue selon les contraintes des projets.</p>
          <h3 class="subTtl">Arolla pour vous aider</h3>
          <p>
             <span class="hglgt">Notre m&eacute;tier est d'&ecirc;tre &agrave; jour et de vous accompagner lors de la mise en application gr&acirc;ce &agrave; nos retours d'exp&eacute;riences. Contactez-nous sans attendre pour profiter des progr&egrave;s de l'&eacute;tat de l'art :</span>
             <ul>
               <li><a href="mailto:cyrille.martraire@arolla.fr">Cyrille Martraire, Associ&eacute;, Directeur Technique</a></li>
               <li><a href="mailto:jonathan.salmona@arolla.fr">Jonathan Salmona, Directeur Commercial</a></li>
             </ul>
          </p>
        </div>
      </div>
    </article>
    <article id="csltOfr">
      <div class="artcnt">
        <h2>Offre de conseil</h2>
        <div class="cnt">
          <p>Depuis sa cr&eacute;ation, <span class="hglgt">Arolla</span> se positionne en 
             <span class="hglgt">expert des technologies et approches de d&eacute;veloppement</span>,
             du terminal mobile &agrave; l'entreprise dans son int&eacute;gralit&eacute;.
             Cette approche s'articule autour de la programmation orient&eacute;e objet et de ses principes,
             toujours d'actualit&eacute; mais qui s'enrichissent d&eacute;sormais des principes de la 
             <span class="hglgt">programmation fonctionelle</span>.</p>
          <p>Certaines comp&eacute;tences survivent &agrave; toutes les modes, et c'est le cas des fondamentaux de l'orient&eacute; objet.
             Au-del&agrave; des modes passag&egrave;res sur les frameworks techniques et les strat&eacute;gies d'architecture,
             les principes de faible couplage et de forte coh&eacute;sion, d'immutabilit&eacute; et d'absence d'effets de bords,
             ainsi que les nombreux patterns de la litt&eacute;rature forment un solide socle de comp&eacute;tences
             pr&ecirc;t &agrave; accueillir les nombreuses et fr&eacute;quentes innovations de fa&ccedil;on pragmatique.</p>
          <p>Les plateformes telles que la JVM et .Net, d&eacute;sormais des standards dans les entreprises,
             supportent d&eacute;j&agrave; toutes ces approches, avec des langages tels que Java, C#, Groovy et Ruby,
             et sont au coeur d'&eacute;cosyst&egrave;mes dynamiques, avec des normes et frameworks
             qui prennent en charge des aspects complets d'un syst&egrave;me logiciel.
             La norme JPA et les frameworks ORM (Hibernate et NHibernate) pour la persistance,
             l'injection des d&eacute;pendances avec Spring ou Guice en sont quelques exemples.</p>
          <p><span class="hglgt">Arolla</span> est Microsoft Silver Partner pour la comp&eacute;tence D&eacute;veloppement d'Application.</p>
        </div>
      </div>
    </article>
  </section>
  <footer>
    <p>Arolla @ 2014. All Rights Reserved.</p>
  </footer>
  <script type="text/javascript">
/** /
(function() {
  $(document).ready(function(){
    if(! (/Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.test(navigator.userAgent))) {
      //alert('Not on smartphone !');
      $('a.art, a.artlnk').click(function(event) {
        var curid = $(this).attr('href');
        $('html, body').animate(
          { scrollTop: $(curid).offset().top }
        , 500
        , 'easeInQuint');
        return false;
      });
    } else {
    
    }
    var valeur = Math.floor((Math.random() * 4) + 1);
    $('body').css('background-image', 'url(\'images/Arolla_S' + valeur + '.jpg\')')
  });
}) ();
/**/
  </script>
</body>
</html>
